# 14.6 Stack and Unstack

### Recall pivot

#### import required modules and load data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:\\Users\\rs\\Downloads\\01 Data Science Lab Copy\\02 Lab Data\\Python\\pandas_users.csv')

In [3]:
df

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

#### weekday and city wise, number of visitors

In [4]:
visitors_pivot = df.pivot(index = 'weekday', columns = 'city', values = 'visitors')

In [5]:
visitors_pivot

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

#### weekday and city wise, number of signups

In [6]:
signup_pivots = df.pivot(index = 'weekday', columns = 'city', values = 'signups')

In [7]:
signup_pivots

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

#### weekday and city wise, number of visitors and signups

In [8]:
visitors_signups_pivots = df.pivot(index = 'weekday', columns = 'city')

In [9]:
visitors_signups_pivots

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

Stack is useful to work with multi-level index

#### import required packages and load data

In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('C:\\Users\\rs\\Downloads\\01 Data Science Lab Copy\\02 Lab Data\\Python\\pandas_users.csv')

In [12]:
df

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

#### set multi-level index

In [13]:
df = df.set_index(['city', 'weekday'])

In [15]:
df

                visitors  signups
city   weekday
Austin Sun           139        7
Dallas Sun           237       12
Austin Mon           326        3
Dallas Mon           456        5

#### by weekday

In [18]:
df.unstack?

In [16]:
byweekday = df.unstack(level = 'weekday')

In [17]:
byweekday

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

#### revert it

In [21]:
byweekday.stack?

In [19]:
df1 = byweekday.stack(level = 'weekday')

In [20]:
df1

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

Recall melt and pivot_table from 30. Cleaning Data (ETL) chapter

# 14.7 Groupby and Aggregations

## Exercise 1 - work with groupby and aggregations

#### import required packages and load data

In [23]:
import pandas as pd

In [27]:
sales = pd.DataFrame({'weekday' : ['Sun', 'Sun', 'Mon', 'Mon'],
                     'city' : ['Austin', 'Dallas', 'Austin', 'Dallas'],
                     'bread' : [139, 237, 326, 456],
                     'butter' : [20, 45, 70, 98]})

#### observe sales data

In [28]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

#### boolean filter and count

In [29]:
sales.loc[sales['weekday'] == 'Sun'].count()

weekday    2
city       2
bread      2
butter     2
dtype: int64

In [30]:
sales.loc[sales['weekday'] == 'Mon'].count()

weekday    2
city       2
bread      2
butter     2
dtype: int64

#### groupby and count

In [31]:
sales.groupby('weekday').count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

#### groupby and sum

In [32]:
sales.groupby('weekday')['bread'].sum()

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

#### groupby and sum on multiple columns

In [33]:
sales.groupby('weekday')[['bread', 'butter']].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

#### groupby and mean : multi-level index

In [34]:
sales.groupby(['city', 'weekday']).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

#### groupby and max on multiple columns

In [35]:
sales.groupby('city')[['bread', 'butter']].max()

        bread  butter
city
Austin    326      70
Dallas    456      98

#### multiple aggregations

In [36]:
sales.groupby('weekday')[['bread', 'butter']].agg(['max', 'min'])

        bread      butter
          max  min    max min
weekday
Mon       456  326     98  70
Sun       237  139     45  20

#### custom aggregation

In [37]:
def data_range(series):
    return series.max() - series.min()

In [38]:
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

Refer
a. Official website http://pandas.pydata.org/
    
b. Read http://pandas.pydata.org/pandas-docs/stable/

c. Must read & practice http://pandas.pydata.org/pandas-docs/stable/10min.html

d. http://pandas.pydata.org/pandas-docs/stable/cookbook.html

Exercise 1: Py31_1_some_graphs_using_iris_data

a. From labdata use above script understand different graphs

Exercise 2: Py31_2_iris_statistics

a. From labdata use above script understand different statistics

Exercise 3: Py31_3_iris_statistics

a. From labdata use above script understand different statistics